[
    {
      "id": 1,
      "bookName": "Twilight",
      "author": "Stephenie Meyer",
      "image": "https://i.ibb.co/gZgHXxj/twilight.jpg",
      "review": "When Bella Swan moves to Forks, Washington, she meets the mysterious Edward Cullen, a handsome and enigmatic vampire. As their unlikely romance blossoms, Bella finds herself drawn into a dangerous world of supernatural creatures and ancient rivalries. Caught between her love for Edward and her friendship with the werewolf Jacob Black, Bella must navigate the complexities of vampire lore and mortal danger in this captivating tale of forbidden love and self-discovery.",
      "totalPages": 498,
      "rating": 4.2,
      "category": "Fantasy",
      "tags": ["Romance", "Vampire", "Young Adult"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 2005
    },
    {
      "id": 2,
      "bookName": "New Moon",
      "author": "Stephenie Meyer",
      "image": "https://i.ibb.co/B4kVm5J/newmoon.jpg",
      "review": "After a devastating breakup with Edward Cullen, Bella Swan is left shattered and alone. Desperate to escape the pain, she finds solace in her deepening friendship with Jacob Black, who harbors a supernatural secret of his own. As Bella's heart mends and danger looms on the horizon, she discovers that love and loss are inseparable companions in this gripping sequel to 'Twilight'.",
      "totalPages": 563,
      "rating": 4.0,
      "category": "Fantasy",
      "tags": ["Romance", "Werewolf", "Young Adult"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 2006
    },
    {
      "id": 3,
      "bookName": "Eclipse",
      "author": "Stephenie Meyer",
      "image": "https://i.ibb.co/pLC85c5/eclipse.jpg",
      "review": "As Bella Swan faces the most important decision of her life, she finds herself torn between her love for Edward Cullen and her friendship with Jacob Black. With an army of vengeful vampires on the horizon and a dangerous vampire seeking revenge, Bella's choices will determine not only her own fate but the fate of those she holds dear. 'Eclipse' is a gripping tale of love, sacrifice, and the unbreakable bonds that tie us together.",
      "totalPages": 629,
      "rating": 4.1,
      "category": "Fantasy",
      "tags": ["Romance", "Vampire", "Young Adult"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 2007
    },
    {
      "id": 4,
      "bookName": "A Walk to Remember",
      "author": "Nicholas Sparks",
      "image": "https://i.ibb.co/PjydQpM/walk-To-Remember.jpg",
      "review": "In the quiet town of Beaufort, North Carolina, the lives of two teenagers collide in an unexpected romance that will change them forever. Landon Carter, a popular but rebellious high school senior, falls in love with Jamie Sullivan, a kind-hearted minister's daughter with a tragic secret. Through their love, Landon learns the true meaning of compassion, sacrifice, and the power of faith in this poignant tale of love and redemption.",
      "totalPages": 240,
      "rating": 4.5,
      "category": "Romance",
      "tags": ["Inspirational", "Young Adult"],
      "publisher": "Warner Books",
      "yearOfPublishing": 1999
    },
    {
      "id": 5,
      "bookName": "Dracula",
      "author": "Bram Stoker",
      "image": "https://i.ibb.co/RhFVS6Q/dracula.png",
      "review": "When Jonathan Harker travels to Transylvania to assist the enigmatic Count Dracula with a real estate transaction, he soon discovers the horrifying truth about his host. As Dracula sets his sights on London and its unsuspecting residents, a group of intrepid individuals must band together to stop his reign of terror. Bram Stoker's timeless tale of horror and suspense continues to captivate readers with its chilling atmosphere and unforgettable characters.",
      "totalPages": 418,
      "rating": 4.4,
      "category": "Horror",
      "tags": ["Classic", "Gothic", "Vampire"],
      "publisher": "Archibald Constable and Company",
      "yearOfPublishing": 1897
    },
    {
      "id": 6,
      "bookName": "Romeo and Juliet",
      "author": "William Shakespeare",
      "image": "https://i.ibb.co/NxYQV3J/romeo-Juliet.jpg",
      "review": "In the midst of a bitter feud between their families, Romeo Montague and Juliet Capulet fall deeply in love. Despite the obstacles standing in their way, the young lovers defy convention and secrecy to be together. However, their forbidden romance is destined for tragedy as fate conspires against them in this timeless tale of passion, prejudice, and the power of love.",
      "totalPages": 290,
      "rating": 4.7,
      "category": "Drama",
      "tags": ["Tragedy", "Classic", "Love"],
      "publisher": "Thomas Creede",
      "yearOfPublishing": 1597
    },
    {
      "id": 7,
      "bookName": "Jane Eyre",
      "author": "Charlotte Brontë",
      "image": "https://i.ibb.co/q5FWs8X/JaneEyre.jpg",
      "review": "Orphaned at a young age, Jane Eyre grows up under the harsh care of her aunt and cousins before finding refuge at Lowood School. Determined to make her own way in the world, Jane becomes a governess at Thornfield Hall, where she meets the brooding and mysterious Mr. Rochester. As their unlikely romance blossoms, Jane discovers dark secrets that threaten to tear them apart in this compelling Bildungsroman of love, morality, and independence.",
      "totalPages": 510,
      "rating": 4.6,
      "category": "Gothic Fiction",
      "tags": ["Classic", "Romance", "Feminism"],
      "publisher": "Smith, Elder & Co.",
      "yearOfPublishing": 1847
    },
    {
      "id": 8,
      "bookName": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://i.ibb.co/NtGgP8N/Pride-And-Prejudice.jpg",
      "review": "In the world of high society and marriage politics in Regency-era England, Elizabeth Bennet finds herself entangled in a web of misunderstandings and misjudgments when she meets the enigmatic Mr. Darcy. As their initial animosity gives way to mutual respect and affection, Elizabeth must confront her own prejudices and pride while navigating the complexities of family, love, and social class in this witty and romantic comedy of manners.",
      "totalPages": 432,
      "rating": 4.8,
      "category": "Classic",
      "tags": ["Romance", "Satire", "Regency"],
      "publisher": "T. Egerton, Whitehall",
      "yearOfPublishing": 1813
  },
  {
    "id": 9,
    "bookName": "Wuthering Heights",
    "author": "Emily Brontë",
    "image": "https://i.ibb.co/TcFn76S/wuthering.jpg",
    "review": "Set in the wild and windswept moors of Yorkshire, 'Wuthering Heights' is a tale of passion, revenge, and the destructive power of unrequited love. Heathcliff, an orphaned foundling, is taken in by the Earnshaw family and forms an intense bond with his foster sister, Catherine. However, their love is torn apart by social class, jealousy, and Heathcliff's thirst for vengeance. As dark secrets are revealed and tragedy unfolds, 'Wuthering Heights' explores the darkest depths of human nature and the redemptive power of love.",
    "totalPages": 342,
    "rating": 4.5,
    "category": "Gothic Fiction",
    "tags": ["Classic", "Romance", "Revenge"],
    "publisher": "Thomas Cautley Newby",
    "yearOfPublishing": 1847
  }
]
  